---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalElementHasAssociation
source: html/65498d69-09ac-8466-fae3-e0bd5061c745.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalElementHasAssociation Property

"Has Association": Used for Analytical Member, Analytical Panel, Structural Columns, Structural Framing, Floors, Walls, Structural Foundation

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalElementHasAssociation { get; }
```